БухЭксп/InformationRegisters/CW_ПланОплатыИсходящихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПланОплатыИсходящихСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПланОплатыИсходящихСчетов/Ext/ManagerModule.bsl
Процедура ЗаписатьПланОплатыДокумента(СтруктураПланаОплаты) Экспорт
	
	Описание = "";
	СтруктураПланаОплаты.Свойство("Описание", Описание); 	
	
	ЗаписьРегистра = РегистрыСведений.CW_ПланОплатыИсходящихСчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Счет = СтруктураПланаОплаты.Счет;
	ЗаписьРегистра.Прочитать();
	
	Если ЗаписьРегистра.Выбран() 
		И Не ЗначениеЗаполнено(СтруктураПланаОплаты.ПлановаяДата) 
		И Не ЗначениеЗаполнено(Описание) Тогда
		//Если передана пустая дата и описание, просто удаляем запись регистра
		ЗаписьРегистра.Удалить();
		Возврат;
	КонецЕсли;
	
	ЗаписьРегистра.Счет 		= СтруктураПланаОплаты.Счет;
	ЗаписьРегистра.ПлановаяДата	= СтруктураПланаОплаты.ПлановаяДата; 
	ЗаписьРегистра.Описание		= Описание;
	
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры
